[IRI_RocketLauncher_CV X2GrenadeLauncherTemplate]
FriendlyName="Rocket Launcher"
FriendlyNamePlural="Rocket Launchers"
BriefSummary="A standard-issue XCOM rocket launcher, left over from the original alien invasion. This is a versatile heavy weapon, capable of using a variety of ammunition."
TacticalText="A standard-issue XCOM rocket launcher, left over from the original alien invasion. This is a versatile heavy weapon, capable of using a variety of ammunition. <br/><Bullet/> This rocket launcher fires rockets carried by the soldier in their Utility Slots.\n."
AbilityDescName="rocket launcher"

[IRI_RocketLauncher_MG X2GrenadeLauncherTemplate]
FriendlyName="Advanced Rocket Launcher"
FriendlyNamePlural="Advanced Rocket Launchers"
BriefSummary="The advanced version of our rocket launcher uses magnetic coils to boost the rockets' effective range. Alloy frame allows to fire Experimental Rockets."
TacticalText="The advanced version of our rocket launcher uses magnetic coils to boost the rockets' effective range. Alloy frame allows to fire Experimental Rockets. <br/><Bullet/> This rocket launcher fires rockets carried by the soldier in their Utility Slots.\n."
AbilityDescName="rocket launcher"

[IRI_RocketLauncher_BM X2GrenadeLauncherTemplate]
FriendlyName="Elerium Rocket Launcher"
FriendlyNamePlural="Elerium Rocket Launchers"
BriefSummary="The pinnacle of heavy weapon technology, the Elerium launcher uses a controlled burnout method to safely accelerate our heavy ordnance to velocities that seem to violate laws of physics as we understand them, boosting its effective range and accuracy. Structural integrity of the launcher is augmented by Elerium-powered fields, which allows firing Powered Rockets."
TacticalText="The pinnacle of heavy weapon technology, the Elerium launcher uses a controlled burnout method to safely accelerate our heavy ordnance to velocities that seem to violate laws of physics as we understand them, boosting its effective range and accuracy. Structural integrity of the launcher is augmented by Elerium-powered fields, which allows firing Powered Rockets.<br/><Bullet/> This rocket launcher fires rockets carried by the soldier in their Utility Slots.\n."
AbilityDescName="rocket launcher"

[IRI_GiveRocket X2AbilityTemplate]
LocFriendlyName="Give rocket"
LocHelpText="Pass the rocket to a nearby allied soldier."

[IRI_ArmRocket X2AbilityTemplate]
LocFriendlyName="Arm rocket"
LocHelpText="Arm the rocket so it can be fired. Only one rocket can be armed at a time."

[IRI_RocketMobilityPenalty X2AbilityTemplate]
LocFriendlyName="Munitions"
LocLongDescription="Carrying heavy ordnance in Utility Slot is slowing down this soldier. Disposing of the heavy ordnance will remove the penalty."
LocHelpText="Carrying heavy ordnance in Utility Slot is slowing down this soldier. Disposing of the heavy ordnance will remove the penalty."

[IRI_Fire_PlasmaEjector X2AbilityTemplate]
LocFriendlyName="Fire Plasma Ejector"
LocLongDescription="Fire a Plasma Ejector at target area."
LocHelpText="Fire a Plasma Ejector at target area."

[IRI_Fire_PlasmaEjector_Spark X2AbilityTemplate]
LocFriendlyName="Fire Plasma Ejector"
LocLongDescription="Fire a Plasma Ejector at target area."
LocHelpText="Fire a Plasma Ejector at target area."

[IRI_FireLockon X2AbilityTemplate]
LocFriendlyName="Lockon Top Attack"
LocLongDescription="Fire the lockon rocket at a Holo Targeted enemy unit, striking it from the top." 
LocHelpText="Fire the lockon rocket at a Holo Targeted enemy unit, striking it from the top." 

[IRI_LockAndFireLockon X2AbilityTemplate]
LocFriendlyName="Lockon Direct Shot"
LocLongDescription="Fire the lockon rocket directly at an enemy robotic unit. This attack costs two Actions."
LocHelpText="Fire the lockon rocket directly at an enemy robotic unit."

[IRI_LockAndFireLockon_Holo X2AbilityTemplate]
LocFriendlyName="Lockon Direct Shot"
LocLongDescription="Fire the lockon rocket directly at a Holo Targeted enemy unit. Cannot target enemies in High Cover."
LocHelpText="Fire the lockon rocket directly at a Holo Targeted enemy unit."

[IRI_FireLockon_Spark X2AbilityTemplate]
LocFriendlyName="Lockon Top Attack"
LocLongDescription="Fire the lockon rocket at a Holo Targeted enemy unit, striking it from the top." 
LocHelpText="Fire the lockon rocket at a Holo Targeted enemy unit, striking it from the top." 

[IRI_LockAndFireLockon_Spark X2AbilityTemplate]
LocFriendlyName="Lockon Direct Shot"
LocLongDescription="Fire the lockon rocket directly at an enemy robotic unit. This attack costs two Actions."
LocHelpText="Fire the lockon rocket directly at an enemy robotic unit."

[IRI_LockAndFireLockon_Holo_Spark X2AbilityTemplate]
LocFriendlyName="Lockon Direct Shot"
LocLongDescription="Fire the lockon rocket directly at a Holo Targeted enemy unit. Cannot target enemies in High Cover."
LocHelpText="Fire the lockon rocket directly at a Holo Targeted enemy unit."

[IRI_LockonHitBonus X2AbilityTemplate]
LocFriendlyName="Target Size"


[IRI_FireSabot X2AbilityTemplate]
LocFriendlyName="Fire Sabot"
LocLongDescription="Fire a Sabot projectile at a target enemy."
LocHelpText="Fire a Sabot projectile at a target enemy."

[IRI_FireSabot_Spark X2AbilityTemplate]
LocFriendlyName="Fire Sabot"
LocLongDescription="Fire a Sabot projectile at a target enemy."
LocHelpText="Fire a Sabot projectile at a target enemy."

[IRI_SabotHitBonus X2AbilityTemplate]
LocFriendlyName="Target Size"

[IRI_ExperimentalRocket X2TechTemplate]
DisplayName="Experimental Rocket"
Summary="By investing additional resources into the development of heavy ordnance, we could produce more powerful types of ammunition for our shoulder-mounted rocket launchers to increase the versatility of our troops in the field. These Experimental Rockets would be more technologically demanding, and would require at least an Advanced Rocket Launcher to fire." 

[IRI_PoweredRocket X2TechTemplate]
DisplayName="Powered Rocket"
Summary="With enough time and supplies, we could come up with truly groundbreaking designs of heavy munitions fired by our rocket launchers. It would take an Elerium-powered Rocket Launcher to fire these Powered Rockets." 

[IRI_ImprovedRockets X2TechTemplate]
DisplayName="Improved Rockets"
Summary="Now that we have access to better materials and technology, we could upgrade our entire supply of Experimental Rockets to be on par with Powered Rockets." 


[IRI_FireRocketLauncher X2AbilityTemplate]
LocFriendlyName="Fire Rocket"
LocHelpText="Fire a rocket at the target area. Rocket can scatter."

[IRI_FireTacticalNuke X2AbilityTemplate]
LocFriendlyName="Fire Tactical Nuke"
LocHelpText="Fire a tactical elerium nuke at a target area."

[IRI_FireTacticalNuke_Spark X2AbilityTemplate]
LocFriendlyName="Fire Tactical Nuke"
LocHelpText="Fire a tactical elerium nuke at a target area."

[ShockAndAwe X2AbilityTemplate]
-LocLongDescription="Your gauntlet now includes a single-use rocket launcher. Required for all Rocketeer perks."
-LocHelpText="Your gauntlet now includes a single-use rocket launcher. Required for all Rocketeer perks."
-LocPromotionPopupText="<Bullet/> Your gauntlet now includes a single-use rocket launcher.<br/>"
+LocLongDescription="Your gauntlet now includes a single-use rocket launcher, and your Rocket Launcher now comes with one rocket."
+LocHelpText="Your gauntlet now includes a single-use rocket launcher, and your Rocket Launcher now comes with one rocket."
+LocPromotionPopupText="<Bullet/> Your gauntlet now includes a single-use rocket launcher, and your Rocket Launcher now comes with one rocket.<br/>"

[CovertAction_IRI_Nuke X2CovertActionTemplate]
ActionObjective="Refined Elerium"

[CovertActionNarrative_IRI_Nuke X2CovertActionNarrativeTemplate]
ActionName="Refined Elerium"
ActionPreNarrative="We've recently gotten a tip from the Resistance that a secret ADVENT research facility has received a sample of Refined Elerium, a volatile source of immense energy. We could potentially use it to create an incredibly destructive rocket. A small team can attempt to infiltrate the facility and steal the sample, but this dangerous mission will require an Engineer to access the sample, and a Scientist to properly handle it."
ActionPostNarrative="We were able to acquire only a small amount of Refined Elerium. Hopefully, it will be worth the trouble."

[IRI_NuclearMaterial X2ItemTemplate]
FriendlyName = "Refined Elerium"
FriendlyNamePlural = "Refined Elerium"
BriefSummary = "Refined Elerium is a volatile source of immense energy. We could potentially use it to create an incredibly destructive rocket."
TacticalText = "Refined Elerium is a volatile source of immense energy. We could potentially use it to create an incredibly destructive rocket."

[IRI_ArmTacticalNuke X2AbilityTemplate]
LocFriendlyName="Arm Tactical Nuke"
LocHelpText="Arm the Nuke so it can be fired. Only one rocket can be armed at a time."
LocLongDescription="Arm the Nuke so it can be fired. Only one rocket can be armed at a time. Once Armed, Nuke cannot be Disarmed and will self-detonate if not fired in several turns."

[IRI_GiveNuke X2AbilityTemplate]
LocFriendlyName="Give rocket"
LocHelpText="Pass the Tactical Nuke to a nearby allied soldier."

[Reward_IRI_NuclearMaterial X2RewardTemplate]
DisplayName="Rocket Crafting Component"

[IRI_TacticalNuke_Tech X2TechTemplate]
DisplayName="Tactical Elerium Nuke"
Summary="While the Refined Elerium we have acquired with so much trouble is more than powerful enough to fulfill the role of explosive yield in a warhead, we don't have enough of it even for a small number of rockets, and it would be a criminal waste of the precious material. Instead, we'll use the Elerium to jump start a Hydrogen fusion reaction. Foregoing fission will allow us to create a compact nuclear weapon without adverse side effects, like radiation."

[IRI_DetonateTacticalNuke X2AbilityTemplate]
LocFriendlyName="Tactical Nuke Self Detonation"
LocLongDescription="Tactical Nuke detonates automatically in 3 turns after being Armed."
LocHelpText="Tactical Nuke detonates automatically in 3 turns after being Armed."

[FlechetteProject X2TechTemplate]
DisplayName="Rocket: Flechette"
Summary="This anti-personnel rocket disperses a rainstorm of razor-sharp alloy spikes over a large area. Spikes can be blocked by cover, and they are ineffective against armored targets."

[LockonProject X2TechTemplate]
DisplayName="Rocket: Lockon"
Summary="This rocket uses a makeshift missile guidance system with repurposed GREMLIN AI algorithms to attack Holo-Targeted or robotic enemies. The guidance system occupies a lot of space, so we replaced most of the explosive yield with a shaped charge to focus damage on the primary target."

[PlasmaEjectorProject X2TechTemplate]
DisplayName="Plasma Ejector"
Summary="This portable Elerium energy cell allows projecting a highly destructive beam of superheated plasma from one of our shoulder-mounted rocket launchers."
